ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
/*******************************************************************************
* \file cy_ble_stack_gap.h
* \version 2.0
*
* \brief
*  This file contains declarations of public BLE APIs of the Generic Access Profile.
*  It also specifies the defines, constants, and data structures required for the APIs.
*
* 
* Related Document:
*  BLE Standard Spec - CoreV4.2, CSS, CSAs, ESR05, ESR06
* 
********************************************************************************
* \copyright
* Copyright 2014-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/
#ifndef CY_BLE_STACK_GAP_H_
#define CY_BLE_STACK_GAP_H_

/***************************************
* Common stack includes
***************************************/
#include "BLE_config.h"
#include "cy_ble_stack_host_main.h"

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/***************************************
** GAP Constants
***************************************/
/** Bluetooth Device Address size  */
#define CY_BLE_GAP_BD_ADDR_SIZE                              0x06u

/** BD Address type flag*/

/** Public Device Address */
#define CY_BLE_GAP_ADDR_TYPE_PUBLIC                          0x00u
/** Random Device Address */
#define CY_BLE_GAP_ADDR_TYPE_RANDOM                          0x01u
/** Controller generates the Resolvable Private Address based on the local
  * IRK from the resolving list. If the resolving list contains no matching entry,
  * uses the public address. */
#define CY_BLE_GAP_ADDR_TYPE_PUBLIC_RPA                      0x02u
/** Controller generates the Resolvable Private Address based on the local
  * IRK from the resolving list. If the resolving list contains no matching entry,
  * uses random address. */
#define CY_BLE_GAP_ADDR_TYPE_RANDOM_RPA                      0x03u

/** Max data length size  */
#define CY_BLE_GAP_MAX_ADV_DATA_LEN              0x1Fu

/** Max data length size  */
#define CY_BLE_GAP_MAX_SCAN_RSP_DATA_LEN         0x1Fu

/** Security modes  */
#define CY_BLE_GAP_SEC_MODE_1                    0x10u /**< security mode 1 */
#define CY_BLE_GAP_SEC_MODE_2                    0x20u /**< security mode 2 */
#define CY_BLE_GAP_SEC_MODE_MASK                 0xF0u /**< security mode bit mask */


/** Pairing properties MASK for cy_stc_ble_gap_auth_info_t */

/**
 * MASK to set MITM in pairing properties for Secure connections.
 */
#define CY_BLE_GAP_SMP_SC_PAIR_PROP_MITM_MASK    0x01u

/**
 * MASK to set keypress in pairing properties for Secure connections.
 */
#define CY_BLE_GAP_SMP_SC_PAIR_PROP_KP_MASK      0x02u

/** Maximum number of Bonded Devices */
#define CY_BLE_GAP_MAX_BONDED_DEVICE             0x10u

/** Out Of Band (OOB) flag*/
#define CY_BLE_GAP_OOB_ENABLE                    0x01u /**< oob enable */
#define CY_BLE_GAP_OOB_DISABLE                   0x00u /**< oob disable */

/** SMP Key size */
#define CY_BLE_GAP_SMP_LTK_SIZE                  0x10u /**< LTK size */
#define CY_BLE_GAP_SMP_IRK_SIZE                  0x10u /**< IRK size */
#define CY_BLE_GAP_SMP_CSRK_SIZE                 0x10u /**< CSRK size */
#define CY_BLE_GAP_SMP_IDADDR_DATA_SIZE          0x07u /**< ID Address data size */
#define CY_BLE_GAP_SMP_MID_INFO_SIZE             0x0Au /**< Mid info size */

/** Key Distribution Flags */
#define CY_BLE_GAP_SMP_INIT_ENC_KEY_DIST         0x01u /**< Initiator enc key */
#define CY_BLE_GAP_SMP_INIT_IRK_KEY_DIST         0x02u /**< Initiator IRK */
#define CY_BLE_GAP_SMP_INIT_CSRK_KEY_DIST        0x04u /**< Initiator CSRK */
#define CY_BLE_GAP_SMP_RESP_ENC_KEY_DIST         0x10u /**< Peer enc key */
#define CY_BLE_GAP_SMP_RESP_IRK_KEY_DIST         0x20u /**< Peer IRK */
#define CY_BLE_GAP_SMP_RESP_CSRK_KEY_DIST        0x40u /**< Peer CSRK */

/** SMP P256 Public-Private Key Size */
#define CY_BLE_GAP_SMP_P256_PUBLIC_KEY_SIZE      0x40u /**< P256 public key size */
#define CY_BLE_GAP_SMP_P256_PRIVATE_KEY_SIZE     0x20u /**< P256 private key size */

/** Passkey Response */
#define CY_BLE_GAP_REJECT_PASSKEY_REQ            0x00u /**< Reject passkey request */
#define CY_BLE_GAP_ACCEPT_PASSKEY_REQ            0x01u /**< Accept passkey request */

/** Fixed Passkey  */
#define CY_BLE_GAP_PASSKEY_FIXED                 0x01u /**< Fixed passkey */
#define CY_BLE_GAP_PASSKEY_NOT_FIXED             0x00u /**< Non-fixed passkey */


/***************************************
** Bonding definitions
***************************************/
/** No Bonding support */
#define CY_BLE_GAP_BONDING_NONE                          0x00u
/** Bonding support */
#define CY_BLE_GAP_BONDING                               0x01u

/** Encryption key size   */
#define CY_BLE_GAP_ENCRYP_KEY_MIN                        0x07u /**< Min Enc key size */
#define CY_BLE_GAP_ENCRYP_KEY_MAX                        0x10u /**< Max Enc key size */

/** User Passkey size */
#define CY_BLE_GAP_USER_PASSKEY_SIZE                     0x06u /**< user passkey size */

/** Address Masks */
/** random private resolvable addr mask */
#define CY_BLE_GAP_RANDOM_PRIV_RESOLVABLE_ADDR_MASK      0x40u
/** random private non-resolvable addr mask */
#define CY_BLE_GAP_RANDOM_PRIV_NON_RESOLVABLE_ADDR_MASK  0x00u
/** public addr mask */
#define CY_BLE_GAP_PUBLIC_ADDR_MASK                      0x80u
/** random static addr mask */
#define CY_BLE_GAP_RANDOM_STATIC_ADDR_MASK               0xC0u

/** Address Masks */
#define CY_BLE_GAP_RANDOM_NUMBER_SIZE                    0x10u 

/** Device Connected as Role. */
#define CY_BLE_GAP_LL_ROLE_SLAVE                         0x01u /**< Slave role */
#define CY_BLE_GAP_LL_ROLE_MASTER                        0x00u /**< Master role */

/** Link Level Encryption status */
#define CY_BLE_GAP_ENCRYPT_ON                            0x01u /**< Encryption on */
#define CY_BLE_GAP_ENCRYPT_OFF                           0x00u /**< Encryption off */

/** Security Requirements for strict pairing */
/** No security requirement */
#define CY_BLE_GAP_NO_SECURITY_REQUIREMENTS              (0x00u)
/** Unauthenticated legacy pairing */
#define CY_BLE_GAP_SEC_UNAUTH_PAIRING                    (0x01u)
/** Authenticated legacy pairing */
#define CY_BLE_GAP_SEC_AUTH_PAIRING                      (0x02u)
/** Unauthenticated SC pairing */
#define CY_BLE_GAP_SEC_SC_PAIRING_WITH_NO_MITM           (0x04u)
/** Authenticated SC pairing */
#define CY_BLE_GAP_SEC_SC_PAIRING_WITH_MITM              (0x08u)
/** Legacy with OOB pairing */
#define CY_BLE_GAP_SEC_OOB_IN_LEGACY_PAIRING             (0x10u)
/** SC with oob pairing */
#define CY_BLE_GAP_SEC_OOB_IN_SC_PAIRING                 (0x20u)
/** Security requirement bit mask */
#define CY_BLE_GAP_SEC_REQ_BIT_MASK                      (0x3Fu)


