ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
/***************************************
** Enumerated Types
***************************************/
/**
 \addtogroup group_ble_common_api_gap_definitions
 @{
*/

/** Security Levels  */
typedef enum
{
    /** Level 1
        * Mode 1 - No security (No authentication and no encryption)
     */
    CY_BLE_GAP_SEC_LEVEL_1 = 0x00u,

    /** Level 2
        * Mode 1 - Unauthenticated pairing with encryption (No MITM)
        * Mode 2 - Unauthenticated pairing with data signing (No MITM)
     */
    CY_BLE_GAP_SEC_LEVEL_2,
    
    /** Level 3
        * Mode 1 - Authenticated pairing with encryption (With MITM)
        * Mode 2 - Authenticated pairing with data signing (With MITM)
     */
    CY_BLE_GAP_SEC_LEVEL_3,
    
    /** Level 4
        * Secured Connection
     */
    CY_BLE_GAP_SEC_LEVEL_4,

    /** LE Security Level Mask */
    CY_BLE_GAP_SEC_LEVEL_MASK = 0x0Fu

}cy_en_ble_gap_sec_level_t;

/** IO capability  */
typedef enum
{
    /** Platform supports only a mechanism to display or convey only a 6-digit number to the user.*/
    CY_BLE_GAP_IOCAP_DISPLAY_ONLY = 0x00u, 
    
    /** The device has a mechanism whereby the user can indicate 'yes' or 'no'.*/    
    CY_BLE_GAP_IOCAP_DISPLAY_YESNO, 
    
    /** Platform supports a numeric keyboard that can input the numbers '0' through '9' 
        and a confirmation key(s) for  'yes' and 'no'. */
    CY_BLE_GAP_IOCAP_KEYBOARD_ONLY,

    /** Platform does not have the ability to display or communicate a 6 digit decimal number.*/
    CY_BLE_GAP_IOCAP_NOINPUT_NOOUTPUT,

    /** Platform supports a mechanism through which 6 digit numeric value can be displayed 
        and numeric keyboard that can input the numbers '0' through '9'. */
    CY_BLE_GAP_IOCAP_KEYBOARD_DISPLAY
    
} cy_en_ble_gap_iocap_t;

/** Authentication Failed Error Codes */
typedef enum
{
    /** No Error */
    CY_BLE_GAP_AUTH_ERROR_NONE  = 0x00u,

    /** User input of passkey failed. For example, the user cancelled the operation. */
    CY_BLE_GAP_AUTH_ERROR_PASSKEY_ENTRY_FAILED,

    /** Out Of Band data is not available. Applicable if NFC is supported. */
    CY_BLE_GAP_AUTH_ERROR_OOB_DATA_NOT_AVAILABLE,

    /** Pairing procedure cannot be performed as authentication
       requirements cannot be met due to IO capabilities of one or both devices. */
    CY_BLE_GAP_AUTH_ERROR_AUTHENTICATION_REQ_NOT_MET,

    /** Confirm value does not match the calculated compare value.  */
    CY_BLE_GAP_AUTH_ERROR_CONFIRM_VALUE_NOT_MATCH,

    /** Pairing is not supported by the device. */
    CY_BLE_GAP_AUTH_ERROR_PAIRING_NOT_SUPPORTED,

    /** Insufficient key size for the security requirements of this device, 
        or if LTK is lost. */
    CY_BLE_GAP_AUTH_ERROR_INSUFFICIENT_ENCRYPTION_KEY_SIZE,

    /** Command received is not supported. */
    CY_BLE_GAP_AUTH_ERROR_COMMAND_NOT_SUPPORTED,

    /** Pairing failed due to an unspecified reason. */
    CY_BLE_GAP_AUTH_ERROR_UNSPECIFIED_REASON,

    /** Pairing or authentication procedure is disallowed because too little time
        has elapsed since the last pairing request or security request. */
    CY_BLE_GAP_AUTH_ERROR_REPEATED_ATTEMPTS,

    /** Invalid Parameters in Request - Invalid Command length and Parameter value outside range. */
    CY_BLE_GAP_AUTH_ERROR_INVALID_PARAMETERS ,

    /** Indicates to the remote device that the DHKey Check value received doesn't
       match the one calculated by the local device. */
    CY_BLE_GAP_AUTH_ERROR_DHKEY_CHECK_FAILED,
    
    /** Indicates that the confirm values in the numeric comparison protocol
       do not match. */
    CY_BLE_GAP_AUTH_ERROR_NUMERIC_COMPARISON_FAILED,
    
    /** Indicates that the pairing over the LE transport failed due to a Pairing
       Request sent over the BR/EDR transport is in process. */
    CY_BLE_GAP_AUTH_ERROR_BR_EDR_PAIRING_IN_PROGRESS,
    
    /** Indicates that the BR/EDR Link Key generated on the BR/EDR transport cannot
       be used to derive and distribute keys for LE transport. */
    CY_BLE_GAP_AUTH_ERROR_CROSS_TRANSPORT_KEY_GEN_DER_NOT_ALLOWED,

    /** Authentication process timeout - if pairing timeout happens for the first time, 
        the application can choose to re-initiate the pairing procedure. If timeout occurs again, 
        the application may choose to disconnect the peer device. */
    CY_BLE_GAP_AUTH_ERROR_AUTHENTICATION_TIMEOUT = 0x15u,

    /** Link disconnected. */
    CY_BLE_GAP_AUTH_ERROR_LINK_DISCONNECTED = 0x18u

}cy_en_ble_gap_auth_failed_reason_t;

/** GAP address type */
typedef enum
{
    /** Random private non-resolvable address */
    CY_BLE_GAP_RANDOM_PRIV_NON_RESOLVABLE_ADDR = 0x00u,

    /** Random private resolvable address */
    CY_BLE_GAP_RANDOM_PRIV_RESOLVABLE_ADDR = 0x01u,

    /** Public address */
    CY_BLE_GAP_PUBLIC_ADDR = 0x02u,

    /** Random static address */
    CY_BLE_GAP_RANDOM_STATIC_ADDR = 0x03u, 

} cy_en_ble_gap_addr_type_t;

/** Passkey entry notification types.
   These are used for the Cy_BLE_GAP_SecureConnectionKeyNotify API
   as well as with the CY_BLE_EVT_GAP_KEYPRESS_NOTIFICATION event parameter. */
typedef enum
{
    /** Passkey entry started */
    CY_BLE_GAP_PASSKEY_ENTRY_STARTED    = 0x00u,

    /** One digit entered */
    CY_BLE_GAP_PASSKEY_DIGIT_ENTERED = 0x01u,
    
    /** One digit erased */    
    CY_BLE_GAP_PASSKEY_DIGIT_ERASED = 0x02u,
    
    /** All digits cleared */
    CY_BLE_GAP_PASSKEY_CLEARED = 0x03u,

    /** Passkey entry completed */
    CY_BLE_GAP_PASSKEY_ENTRY_COMPLETED  = 0x04u

} cy_en_ble_gap_keypress_notify_type_t;

/** GAP Direct advertiser address type */
typedef enum
{
    /** Public device address type */
    CY_BLE_GAP_PUBLIC_ADDR_TYPE,

    /** Random private resolvable address type*/
    CY_BLE_GAP_RANDOM_RESOLVABLE_ADDR_TYPE,
    
    /** Public Identity address type*/
    CY_BLE_GAP_PUBLIC_IDENTITY_ADDR_TYPE,
    
    /** Random static Identity Address */
    CY_BLE_GAP_RANDOM_IDENTITY_ADDR_TYPE
    
} cy_en_ble_gap_adv_addr_type_t;

