ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
/***************************************
** Exported structures and unions
***************************************/

/** BD Address of device */
typedef cy_stc_ble_bd_addr_t     cy_stc_ble_gap_bd_addr_t;

/** Out of Band Parameters Information  */
typedef struct 
{
    /** bd handle of the remote device */
    uint8_t        bdHandle; 

    /** OOB data presence flag. Allowed value are:
         * CY_BLE_GAP_OOB_DISABLE
         * CY_BLE_GAP_OOB_ENABLE
     */
    uint8_t       oobFlag;  
    
    /** 16 Octet Temporary Key to be used for OOB authentication */
    uint8_t        * key;  

    /** Pointer to OOB data */    
    uint8_t        * oobData;

   /** Length of OOB data */
    uint8_t        oobDataLen;

} cy_stc_ble_gap_oob_info_t;

/** Security requirement of local device used in strict pairing */
typedef struct
{
    /** Security requirement */
    uint8_t       secReq;
    
    /** Encryption key size */
    uint8_t       encKeySize;
} cy_stc_ble_gap_sec_req_t;

/** Disconnect command information */
typedef struct
{
    /** Reason for disconnection */
    uint8_t       reason;

    /** bd handle of the remote device */
    uint8_t       bdHandle;

}cy_stc_ble_gap_disconnect_info_t;

/** Peer Bluetooth Device Address  information */
typedef struct
{
    /** Bluetooth device address */
    cy_stc_ble_gap_bd_addr_t     bdAddr;

    /** bd handle of the remote device */
    uint8_t                   bdHandle;

}cy_stc_ble_gap_peer_addr_info_t;

/** Security keys information */
typedef struct
{
    /** Long Term Key */
    uint8_t       ltkInfo[CY_BLE_GAP_SMP_LTK_SIZE];

    /** Encrypted Diversifier and Random Number */
    uint8_t       midInfo[CY_BLE_GAP_SMP_MID_INFO_SIZE];

    /** Identity Resolving Key */
    uint8_t       irkInfo[CY_BLE_GAP_SMP_IRK_SIZE];

    /**
     * Public device/Static Random address type
     * idAddrInfo[0] - Address Type
     * idAddrInfo[1] to idAddrInfo[6] - Address
     */
    uint8_t       idAddrInfo[CY_BLE_GAP_SMP_IDADDR_DATA_SIZE];

    /** Connection Signature Resolving Key */
    uint8_t       csrkInfo[CY_BLE_GAP_SMP_CSRK_SIZE];

    /** bd handle of the remote device */
    uint8_t       bdHandle; 

} cy_stc_ble_gap_sec_key_param_t;

/** Security information */
typedef struct
{
    /** Security keys information parameter */
    cy_stc_ble_gap_sec_key_param_t   SecKeyParam;

    /**This parameter indicates which keys get exchanged with a peer device.
        *   The following is the bit field mapping for the keys.
        *   Bit 0: Local Encryption information
        *   Bit 1: Local Identity information
        *   Bit 2: Local Signature Key
        *   Bit 3: Reserved
        *   Bit 4: Remote Encryption information
        *   Bit 5: Remote Identity information
        *   Bit 6: Remote Signature Key
        *   Bit 7: Reserved
        */
    uint8_t                       exchangeKeysFlag;

    /**This parameter indicates which keys are to be set/generated in the BLE Stack.
        *  The following is the bit field mapping for the keys.
        *  Bit 0: Local Encryption information
        *  Bit 1: Local Identity information
        *  Bit 2: Local Signature Key
        *  Bits 3-7: Reserved
        */
    uint8_t                       localKeysFlag;

} cy_stc_ble_gap_sec_key_info_t;

/** Bluetooth Device Address information */
typedef struct
{
    /** Identity Resolving Key */
    uint8_t                   irkInfo[CY_BLE_GAP_SMP_IRK_SIZE];

    /** Memory for gapBdAddr. Completion event will
     *  use this memory as output parameter.
     */
    cy_stc_ble_gap_bd_addr_t     gapBdAddr;

    /** Device address type */
    cy_en_ble_gap_addr_type_t   addrType;

}cy_stc_ble_gap_bd_addr_info_t;


/** Authentication Parameters Information  */
typedef struct 
{
    /** Security Mode setting will be value of enum cy_en_ble_gap_sec_level_t as follows:
        * (CY_BLE_GAP_SEC_MODE_1 | CY_BLE_GAP_SEC_LEVEL_2)
        * (CY_BLE_GAP_SEC_MODE_1 | CY_BLE_GAP_SEC_LEVEL_3)
        * (CY_BLE_GAP_SEC_MODE_1 | CY_BLE_GAP_SEC_LEVEL_4)
        * (CY_BLE_GAP_SEC_MODE_2 | CY_BLE_GAP_SEC_LEVEL_2)
        * (CY_BLE_GAP_SEC_MODE_2 | CY_BLE_GAP_SEC_LEVEL_3)
     */
    uint8_t                               security;

    /** Bonding type setting:
         * CY_BLE_GAP_BONDING_NONE
         * CY_BLE_GAP_BONDING
     */
    uint8_t                               bonding;

    /** Encryption Key Size (octets)
         * Minimum = 7 
         * maximum = 16
         For a slave initiated security request, this parameter must be ignored.
     */
    uint8_t                               ekeySize;

    /** Parameter to say whether authentication is accepted or rejected with a reason.
       accepted = CY_BLE_GAP_AUTH_ERROR_NONE or error code cy_en_ble_gap_auth_failed_reason_t. */
    cy_en_ble_gap_auth_failed_reason_t      authErr;

   /**
    * Bit 0: MITM (Applicable only if Secure connections)
    *        Use CY_BLE_GAP_SMP_SC_PAIR_PROP_MITM_MASK
    * Bit 1: Key press (sets Key press bit in authentication requirements flags of
    *        pairing request/response. Applicable only for secure connections)
    *        Use CY_BLE_GAP_SMP_SC_PAIR_PROP_KP_MASK
    * Bit [2-7]: RFU
    */
    uint8_t                               pairingProperties;

    /** Peer bdHandle */
    uint8_t                               bdHandle;

} cy_stc_ble_gap_auth_info_t;


/** Authentication Passkey Information  */
typedef struct 
{
    /** 6-digit decimal number (authentication passkey) */
    uint32_t                      passkey;

    /** Accept or reject passkey entry request. Allowed values are,
           * CY_BLE_GAP_REJECT_PASSKEY_REQ
           * CY_BLE_GAP_ACCEPT_PASSKEY_REQ
     */
    uint8_t                       accept;

    /** bdHandle */
    uint8_t                       bdHandle;

}cy_stc_ble_gap_auth_pk_info_t;


/** Fixed Passkey Parameters Information  */
typedef struct 
{
    /** 6-digit decimal number (<=999999). This is used only if isFixed is
            set to true, else ignored */
    uint32_t                      fixedPassKey;

