ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
    /** Peer bdHandle */
    uint8_t                       bdHandle;

    /** Passkey is fixed application,
           * CY_BLE_GAP_PASSKEY_FIXED: 'fixedPassKey' will be used by the BLE Stack that is provided by the application.
           * CY_BLE_GAP_PASSKEY_NOT_FIXED: 'fixedPassKey' will be ignored and the BLE Stack will generate as per
                security procedure.
     */
    uint8_t                       isFixed;

}cy_stc_ble_gap_auth_fix_pk_info_t;


/** GAP Connection Update parameters  */
typedef struct
{
    /** Minimum value for the connection event interval. This shall be less than
       or equal to conn_Interval_Max. Minimum connection interval will be
         connIntvMin * 1.25 ms
        * Time Range: 7.5 ms to 4 sec
     */
    uint16_t      connIntvMin;

    /** Maximum value for the connection event interval. This shall be greater
       than or equal to conn_Interval_Min. Maximum connection interval will be
         connIntvMax * 1.25 ms
     * Time Range: 7.5 ms to 4 sec
     */
    uint16_t      connIntvMax;

    /** Slave latency for the connection in number of connection events.
        * Range: 0x0000 to 0x01F3
     */
    uint16_t      connLatency;

    /** Supervision timeout for the LE Link. Supervision timeout will be
       supervisionTO * 10 ms
        * Time Range: 100 msec to 32 secs
     */
    uint16_t      supervisionTO;

    /** Peer bdHandle */
    uint8_t       bdHandle;

    /** connection length */
    uint16_t      ceLength;

}cy_stc_ble_gap_conn_update_param_info_t;


/** Secure connection only mode parameters  */
typedef struct 
{
    /** state: 0 - Disable (Device not in secure connections only mode) \n
               1 - Enable (Device is in secure connections only mode) */
    uint8_t       state;

}cy_stc_ble_gap_sc_mode_info_t;

/** Secure connection key press notification parameters  */
typedef struct 
{
    /** Peer bdHandle */
    uint8_t                           bdHandle;

    /** notification type to be sent to remote identified by bdHandle */
    cy_en_ble_gap_keypress_notify_type_t  notificationType;

}cy_stc_ble_gap_sc_kp_notif_info_t;

/** Secure connection key press notification parameters  */
typedef struct 
{
    /** 16 Bytes Random number to be used for generating OOB data */
    uint8_t       *rand;

    /** Peer bdHandle */
    uint8_t       bdHandle;
}cy_stc_ble_gap_sc_oob_info_t;


/** Bluetooth Bonded Device Address list */
typedef struct
{
    /** Pointer to list of Bluetooth device addresses and corresponding bdHandle of bonded devices */
    cy_stc_ble_gap_peer_addr_info_t      * bdHandleAddrList;

    /** Number of bonded devices */
    uint8_t                           noOfDevices;

}cy_stc_ble_gap_bonded_device_list_info_t;

/** SMP P-256 public-private key pair */
typedef struct
{
    /** P-256 public key */
    uint8_t publicKey[CY_BLE_GAP_SMP_P256_PUBLIC_KEY_SIZE];
    
    /** P-256 private key */
    uint8_t privateKey[CY_BLE_GAP_SMP_P256_PRIVATE_KEY_SIZE];
    
    /** If it is set to 1, the public key is validated. If it is set to 0, 
    public key is not validated. This parameter is not applicable for
    CY_BLE_EVT_GAP_GEN_SET_LOCAL_P256_KEYS_COMPLETE event. */
    uint8_t isValidateKeys;
    
} cy_stc_ble_gap_smp_local_p256_keys_t;

/** GAP Connection Update parameters  */
typedef struct
{

    /** connection length */
    uint16_t      ceLength;

    /** Peer bdHandle */
    uint8_t       bdHandle;

}cy_stc_ble_gap_ce_length_param_info_t;

/** GAP Connection Update parameters  */
typedef struct
{
    /** Priority of the connection compared to other connection */
    /** 0x00 Highest and 0xFF lowest and default for all the connections */
    uint8_t       connPriority;

    /** Peer bdHandle */
    uint8_t       bdHandle;

}cy_stc_ble_gap_set_conn_priority_param_t;

/* --------------------------Structure corresponding to events-------------------- */

/** Current Connection Parameters used by controller */
typedef struct
{
    /** Status corresponding to this event will be the HCI error code 
    as defined in BLE spec 4.1 */
    uint8_t       status;

    /** Connection interval used on this connection. 
        * Range: 0x0006 to 0x0C80
        * Time Range: 7.5 ms to 4 sec 
     */
    uint16_t      connIntv;

    /** Slave latency for the connection in a number of connection events.
        * Range: 0x0000 to 0x01F3 
     */
    uint16_t      connLatency;

    /** Supervision timeout for the LE Link. Supervision timeout will be  
       supervisionTO * 10 ms
       * Time Range: 100 msec to 32 secs 
     */
    uint16_t      supervisionTO;

    /** bd handle of the remote device */
    uint8_t       bdHandle; 

}cy_stc_ble_gap_conn_param_updated_in_controller_t;

/** Gap Connected Parameters */
typedef struct
{
    /** status corresponding to this event will be HCI error code 
        as defined in BLE spec 4.1 */
    uint8_t       status;

    /** bd handle of the remote device */
    uint8_t       bdHandle; 

    /** Connected as - master = CY_BLE_GAP_LL_ROLE_MASTER,
        Slave = CY_BLE_GAP_LL_ROLE_SLAVE */
    uint8_t       role; 

    /** Address type of the Bluetooth device address
        - CY_BLE_GAP_ADDR_TYPE_PUBLIC (Public device address)
        - CY_BLE_GAP_ADDR_TYPE_RANDOM (Random device address) */
    uint8_t       peerAddrType; 

    /** Peer Bluetooth device address of size CY_BLE_BD_ADDR_SIZE*/
    uint8_t       * peerAddr;

    /** Connection interval used on this connection. 
        * Range: 0x0006 to 0x0C80
        * Time Range: 7.5 ms to 4 sec 
     */
    uint16_t      connIntv;

    /** Slave latency for the connection in number of connection events.
        * Range: 0x0000 to 0x01F3
     */
    uint16_t      connLatency;

    /** Supervision timeout for the LE Link. Supervision timeout will be  
            supervisionTO * 10 ms
            Time Range: 100 msec to 32 secs 
     */
    uint16_t      supervisionTO;

    /** Master Clock Accuracy parameter is only valid for a slave. On a master,
        this parameter shall be set to 0x00.*/
    uint8_t       masterClockAccuracy; 

}cy_stc_ble_gap_connected_param_t;

/** OOB data */
typedef struct
{
    /** Peer bdHandle */
    uint8_t   bdHandle;

