ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
    /** Status corresponding to this event will be HCI error code 
            as defined in BLE spec 4.2 */
    uint8_t   status;

    /** Rand for OOB. This is also stored in stack */
    uint8_t   * key; 

    /** OOB Data using 'key' and local Public Key */
    uint8_t   * oobData; 

    /** Length of OOB data which is 16 Bytes for Secure connections */
    uint8_t   oobDataLen; 
    
}cy_stc_ble_gap_oob_data_param_t;

/** Current Connection Parameters used by controller */
typedef struct
{
    /** Connection interval used on this connection.
     * Range: 0x0006 to 0x0C80
     * Time Range: 7.5 ms to 4 sec
     */
    uint16_t                      connIntv;

    /** Slave latency for the connection in number of connection events.
     * Range: 0x0000 to 0x01F3
     */
    uint16_t                      connLatency;

    /** Supervision timeout for the LE Link. Supervision timeout will be
     * supervisionTO * 10 ms
     * Time Range: 100 msec to 32 secs
     */
    uint16_t                      supervisionTo;

    /** Peer Device Address  */
    uint8_t                       * peerBdAddr;

    /** Peer Device Address type  */
    cy_en_ble_gap_adv_addr_type_t   peerBdAddrType;

    /** Local Resolvable Private Address  
     * Resolvable Private Address being used by the local device
     * for this connection.
     * This is valid only when the Own_Address_Type in 
     * connection/advertisement parameters 
     * is set to 0x02 or 0x03. For other Own_Address_Type values,
     * this will be all zeros.
     */
    uint8_t                       * localResolvablePvtAddr;

    /** Peer Resolvable Private Address  
     * Resolvable Private Address being used by the peer device
     * for this connection.
     * This is valid only for the Peer_Address_Type
     * 0x02 or 0x03. For other Peer_Address_Type values,
     * this will be all zeros.
    */
    uint8_t                       * peerResolvablePvtAddr;

    /** Connected as - master = CY_BLE_GAP_LL_ROLE_MASTER,
        Slave = CY_BLE_GAP_LL_ROLE_SLAVE */
    uint8_t                       role;

    /** Master clock accuracy
     * 0x00 -> 500 ppm
     * 0x01 -> 250 ppm
     * 0x02 -> 150 ppm
     * 0x03 -> 100 ppm
     * 0x04 -> 75 ppm
     * 0x05 -> 50 ppm
     * 0x06 -> 30 ppm
     * 0x07 -> 20 ppm
     */
    uint8_t                       masterClockAccuracy;

    /** Status corresponding to this event will be HCI error code.
     * Values of 0 indicates connection successfully completed.
     * Refer BLE spec 4.2,Vol2, Part D for Error codes.
     */
    uint8_t                       status;
    
    /** bd handle of the remote device */
    uint8_t                       bdHandle; 

}cy_stc_ble_gap_enhance_conn_complete_param_t;

/** Disconnection Parameters */
typedef struct 
{
    /** HCI error code as defined in Bluetooth 4.1 core specification, Volume 2,
       Part D, section 1.3  */
    uint8_t       status;

    /** Peer bdHandle */
    uint8_t       bdHandle;

    /** Reason for disconnection */
    uint8_t       reason;

}cy_stc_ble_gap_disconnect_param_t;

/** Encryption Change Parameters */
typedef struct 
{
    /** Peer bdHandle */
    uint8_t       bdHandle;

    /** Encryption change event for active connection. 'evParam' can be decoded as
         encryption = CY_BLE_GAP_ENCRYPT_OFF -> Encryption OFF
         encryption = CY_BLE_GAP_ENCRYPT_ON -> Encryption ON */
    uint8_t       encryption;

}cy_stc_ble_gap_encrypt_change_param_t;
/** @} */

/***************************************
** Exported APIs
***************************************/
/**
 \addtogroup group_ble_common_api_gap_functions
 @{
*/

/******************************************************************************
* Function Name: Cy_BLE_GAP_SetIoCap
***************************************************************************//**
* 
*  This function sets the input and output capability of the BLE Device that is
*  used during authentication procedure. This is a blocking function. No event
*  is generated on calling this function. The input capabilities are described
*  in the following table:
*  
*   Capability  | Description
*   ----------- | -----------
*   No input    | Device does not have the ability to indicate "yes" or "no".
*   Yes/No      | Device has at least two buttons that can be easily mapped to "yes" and "no" or the device has a mechanism whereby the user can indicate either "yes" or "no".
*   Keyboard    | Device has a numeric keyboard that can input the numbers "0" through "9" and a confirmation. Device also has at least two buttons that can be easily mapped to "yes" and "no" or the device has a mechanism whereby the user can indicate either "yes" or "no".
*
*  The output capabilities are described in the following table:
*
*   Capability       | Description
*   -----------      | -----------
*   No output        | Device does not have the ability to display or communicate a 6-digit decimal number.
*   Numeric output   | Device has the ability to display or communicate a 6-digit decimal number.
*  
*  The combined capability is defined in the following table:
*
*   Input Capability     | No Output          | Numeric Output
*   -----------          | -----------        | ------------
*   No input             | NoInputNoOutput    | DisplayOnly
*   Yes/No               | NoInputNoOutput    | DisplayYesNo
*   Keyboard             | KeyboardOnly       | KeyboardDisplay
*  
*  This is a blocking function. No event is generated on calling this function.
*     
* \param param: IO parameter is of type cy_en_ble_gap_iocap_t. 
*     
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                     | Description
*   ------------                     | -----------
*   CY_BLE_SUCCESS                   | On successful operation
*   CY_BLE_ERROR_INVALID_PARAMETER   | On specifying invalid input parameter
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_SetIoCap
(
    const cy_en_ble_gap_iocap_t  * param
);

