ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
/******************************************************************************
* Function Name: Cy_BLE_GAP_SetSecurityRequirements
***************************************************************************//**
*
*  This function is used to set the security requirements of local device and encryption
*  key size requirement of the local device. This is a blocking function. No event 
*  is generated on calling this function. It is expected to call this API on host stack 
*  on, though can be called at any point except when any of SMP procedure is in progress. 
*  Security requirements are defined in the following table:
*
*   Security Requirement                   | Description
*   ----------------------                 | -----------
*   CY_BLE_GAP_NO_SECURITY_REQUIREMENTS    | Default:Security requirement specifies there are no security requirements
*   CY_BLE_GAP_SEC_UNAUTH_PAIRING          | Bit 0: Legacy pairing with NO MITM protection
*   CY_BLE_GAP_SEC_AUTH_PAIRING            | Bit 1: Legacy pairing with MITM protection
*   CY_BLE_GAP_SEC_SC_PAIRING_WITH_NO_MITM | Bit 2: Secured Connection pairing with NO MITM protection
*   CY_BLE_GAP_SEC_SC_PAIRING_WITH_MITM    | Bit 3: Secured Connection pairing with MITM protection
*   CY_BLE_GAP_SEC_OOB_IN_LEGACY_PAIRING   | Bit 4: Legacy pairing with OOB method
*   CY_BLE_GAP_SEC_OOB_IN_SC_PAIRING       | Bit 5: Secured Connection pairing with OOB method
*
*  After this API is called, the BLE Stack will check whether the received 
*  security request or pairing request or pairing response satisfies local 
*  device security requirements that are set using this API. If local device
*  security requirements are not met, then pairing is rejected by the BLE stack.
*
*  For example: Cy_BLE_GAP_SetSecurityRequirements() is called with secReq as CY_BLE_GAP_SEC_SC_PAIRING_WITH_MITM.
*  Now if the BLE Stack receives any pairing request with SC bit and MITM bit are not set, 
*  then that pairing request will be rejected by the stack.
*
*  Note: If the Secured Connection (SC) Only mode is set, then these security requirements are not 
*  considered during pairing procedure. This is to maintain BWC for SC Only mode.
*
*  \param param: Parameter is pointer to type cy_stc_ble_gap_sec_req_t.
*
*   secReq: Security requirement is a bit-field parameter. The application can
*     set this value with the above defined values in the table. The application can set 
*     multiple security requirements by ORing them in this parameter.
*     For example: If secReq is (CY_BLE_GAP_SEC_UNAUTH_PAIRING | CY_BLE_GAP_SEC_SC_PAIRING_WITH_NO_MITM),
*     then the stack allows pairing only if the received pairing request is either Legacy 
*     pairing with NO MITM or Secured Connection pairing with NO MITM.
*
*   encKeySize: Encryption key size requirement of the local device. 
*     This parameter does not affect anything on the central side. At the peripheral side,
*     when encryption key size is set using this API, then after during pairing if 
*     the negotiated key size is less than the key size set by this API, then the BLE Stack will 
*     reject that pairing request.
*
*     
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                     | Description
*   ------------                     | -----------
*   CY_BLE_SUCCESS                   | On successful operation
*   CY_BLE_ERROR_INVALID_PARAMETER   | On specifying invalid input parameter
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_SetSecurityRequirements
(
    cy_stc_ble_gap_sec_req_t * param
);

/******************************************************************************
* Function Name: Cy_BLE_GAP_SetOobData
***************************************************************************//**
* 
*  This function sets OOB presence flag and data. This function should be used 
*  by the application layer if it wants to enable OOB bonding procedure for any
*  specific device identified by 'bdHandle'. This function should be called
*  before initiating authentication or before responding to an authentication
*  request to set OOB flag and data. 
*
*  This is a blocking function. No event is generated on calling this function.
*     
* \param param: parameter is of type cy_stc_ble_gap_oob_info_t. 
*  param->oobData is ignored in case of the Legacy Pairing procedure.
*         
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                     | Description
*   ------------                     | -----------
*   CY_BLE_SUCCESS                   | On successful operation
*   CY_BLE_ERROR_INVALID_PARAMETER   | On specifying NULL as input parameter
*   CY_BLE_ERROR_NO_DEVICE_ENTITY    | 'bdHandle' does not represent known device entity
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_SetOobData 
(   
    cy_stc_ble_gap_oob_info_t * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_GenerateBdAddress
***************************************************************************//**
* 
*  This function generates either public or random address based on 'type' specified by 
*  'cy_en_ble_gap_addr_type_t' filed of 'cy_stc_ble_gap_bd_addr_info_t'. 
*  It uses BLE Controller's random number generator to generate the random part of the 
*  Bluetooth device address.
*  
*  This is none blocking function. Generated address is informed through 'CY_BLE_EVT_GAP_DEVICE_ADDR_GEN_COMPLETE'
* 
*  \param param: Buffer is of type cy_stc_ble_gap_bd_addr_info_t.
*              param->irk: Buffer containing 128-bit 'IRK' data. This parameter is only
*                                 used when CY_BLE_GAP_RANDOM_PRIV_RESOLVABLE_ADDR is the value set to
*              param->addrType'. type of address to be generated.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
* 
* \note: 
*  Note1: param should point to valid memory location until completion of API
        is indicated via the CY_BLE_EVT_GAP_DEVICE_ADDR_GEN_COMPLETE event.
*  Note2: To guarantee that sequential calls to Cy_BLE_GAP_GenerateBdAddress API generate different addresses,
*         a call to Cy_BLE_GenerateRandomNumber should be made between calls made
*        to the Cy_BLE_GAP_GenerateBdAddress API. These calls to the Cy_BLE_GenerateRandomNumber API
*        should use unique seeds for these calls.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GenerateBdAddress
(
    cy_stc_ble_gap_bd_addr_info_t  * param
);


