ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
/******************************************************************************
* Function Name: Cy_BLE_GAP_Disconnect
***************************************************************************//**
* 
*  This function disconnects the peer device. It is to be used by the device in
*  GAP Central mode and may be used by a GAP Peripheral device to send a
*  disconnect request. This is a non-blocking function. On disconnection, the
*  following events are generated, in order.
*  * CY_BLE_EVT_GATT_DISCONNECT_IND
*  * CY_BLE_EVT_GAP_DEVICE_DISCONNECTED
*     
* \param param: parameter is of type 'cy_stc_ble_gap_disconnect_info_t'
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                         | Description
*   ------------                         | -----------
*   CY_BLE_SUCCESS                       | On successful operation
*   CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' pointer is NULL
*   CY_BLE_ERROR_NO_DEVICE_ENTITY        | Device identified using 'bdHandle' does not exist
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES  | Stack resources are unavailable
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_Disconnect
(
    cy_stc_ble_gap_disconnect_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_GetPeerBdAddr
***************************************************************************//**
* 
*  This function reads the peer Bluetooth device address that has already been
*  fetched by the BLE Stack. 'peerBdAddr' stores the peer's Bluetooth device
*  address identified with 'bdHandle'. 
*
*  This is a blocking function. No event is generated on calling this function.
*
* \param param: parameter is of type cy_stc_ble_gap_peer_addr_info_t, where 
*             param->bdHandle: Peer device handle, input parameter
*             param->bdAddr: Empty buffer where the peer Bluetooth device address will be stored.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                     | Description
*   ------------                     | -----------
*   CY_BLE_SUCCESS                   | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER   | On specifying NULL as input parameter for 'peerBdAddr'.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY    | Specified device handle does not map to any device handle entry in the BLE stack.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GetPeerBdAddr
(
    cy_stc_ble_gap_peer_addr_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_GetPeerBdHandle
***************************************************************************//**
* 
*  This function reads the device handle of the remote Bluetooth device using 
*  'peerBdAddr', which has already been fetched by the BLE Stack. 'bdHandle'
*  stores the peer device handle. 
*
*  This is a blocking function. No event is generated on calling this function.
*     
* \param param: parameter is of type cy_stc_ble_gap_peer_addr_info_t, where 
*             param->bdHandle: buffer where peer device handle will be stored, output parameter
*             param->bdAddr: Peer Bluetooth device address will be stored.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                         | Description
*   ------------                         | ----------
*   CY_BLE_SUCCESS                       | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER       | On specifying NULL as input parameter for 'peerBdAddr' or 'bdHandle'.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY        | Specified device address does not map to any entry in BLE stack.
*             
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GetPeerBdHandle
(
    cy_stc_ble_gap_peer_addr_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_GetPeerDevSecurity
***************************************************************************//**
* 
*  This function enables the application to get the device security of the peer
*  device, which has already been fetched by the BLE Stack, identified using 
*  'bdHandle' when the peer device is in the trusted list. 
*
*  This is a blocking function. No event is generated on calling this function.
* 
* \param param: Pointer to a buffer of type 'cy_stc_ble_gap_auth_info_t' into which security 
*                        information will be written.
*            param->security: It ignores LE Security mode. Security should be interpreted as MITM and no MITM as
*          encryption is always supported if pairing is performed between two devices.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                         | Description
*   ------------                         | -----------
*   CY_BLE_SUCCESS                       | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER       | On specifying NULL as input parameter for 'authInfo'.
*   CY_BLE_ERROR_INVALID_OPERATION       | An error occurred in the BLE stack.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY        | Specified device handle does not map to any device handle entry in the BLE stack.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GetPeerDevSecurity 
(   
    cy_stc_ble_gap_auth_info_t  * param
);


