ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
/******************************************************************************
* Function Name: Cy_BLE_GAP_GetPeerDevSecurityKeyInfo
***************************************************************************//**
*
*  This function enables the application to know the keys shared by a given peer
*  device upon completion of the security sequence (already fetched by the BLE
*  Stack). The keys are shared by the peer device on initiation of authentication, which
*  is performed using the Cy_BLE_GAP_AuthReq() or Cy_BLE_GAPP_AuthReqReply()
*  function.
*
*  This is a blocking function. No event is generated on calling this function.
*
*  \param param: buffer is of type cy_stc_ble_gap_sec_key_info_t, where peer device security
*                         information will be stored.
*              param->SecKeyParam.bdHandle: input parameters
*              param->localKeysFlag : ignored
*              param->exchangeKeysFlag : Keys exchanged by peer (output parameter)
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                     | Description
*   ------------                     | -----------
*   CY_BLE_SUCCESS                   | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER   | On specifying NULL as input parameter for 'keyInfo'.
*   CY_BLE_ERROR_INVALID_OPERATION   | An error occurred in BLE stack.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY    | Device identified using 'bdHandle' does not exist.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GetPeerDevSecurityKeyInfo
(
    cy_stc_ble_gap_sec_key_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_GetLocalDevSecurityKeyInfo
***************************************************************************//**
* 
*  This function gets the local device's keys and key flags. The IRK received from
*  this function should be used as the input IRK for the function 
*  'Cy_BLE_GAP_GenerateDeviceAddress' to generate Random Private Resolvable address.
*  This is a blocking function. No event is generated on calling this function.
* 
*  \param param: buffer is of type cy_stc_ble_gap_sec_key_info_t, where local device security
*                         information will be stored.
*             param->SecKeyParam.bdHandle: keys corresponding to peer device
*             param->localKeysFlag : ignored
*             param->exchangeKeysFlag : Key to be sent to peer (output parameter)
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                         | Description
*   ------------                         | -----------
*   CY_BLE_SUCCESS                       | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER       | On specifying NULL as input parameters
*   CY_BLE_ERROR_NO_DEVICE_ENTITY        | Device identified using 'bdHandle' does not exist.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GetLocalDevSecurityKeyInfo
(
   cy_stc_ble_gap_sec_key_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_SetSecurityKeys
***************************************************************************//**
* 
*  This function sets the security keys that are to be exchanged with a peer
*  device during key exchange stage of the authentication procedure and sets it in the 
*  BLE Stack. The application is expected to set new keys for new connections. By default,
*  stack will use 'ZEROs' for the keys if not set by the application. The last set keys will be used 
*  by the BLE stack during the pairing procedure.
*
*  This is a blocking function. No event is generated on calling this function.
* This API should be called before the pairing process begins, preferably after 
* 'CY_BLE_EVT_GAP_DEVICE_CONNECTED or CY_BLE_EVT_GAP_ENHANCE_CONN_COMPLETE'
* is received.
*
*  \param param: buffer is of type cy_stc_ble_gap_sec_key_info_t, which contains the 
*                         security keys to be set to BLE Stack.
*              param->SecKeyParam.bdHandle: input parameters
*              param->exchangeKeysFlag : input parameters 
*              param->localKeysFlag : input parameters
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                         | Description
*   ------------                         | -----------
*   CY_BLE_SUCCESS                       | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER       | On specifying NULL as input parameter for 'keyInfo'
*   CY_BLE_ERROR_NO_DEVICE_ENTITY        | Device identified using 'bdHandle' does not exist.
* 
* \note:
*       Note1: idAddrInfo is ignored as it is device level information.
*        Use Cy_BLE_GAP_SetIdAddress to set the ID address for the device.
*       Note2: 'exchangeKeysFlag' flags will automatically be ignored if this does not match with 
*        the exchange key flag received for a peer during pairing process.
******************************************************************************/    
cy_en_ble_api_result_t Cy_BLE_GAP_SetSecurityKeys
(
    cy_stc_ble_gap_sec_key_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_GenerateKeys
***************************************************************************//**
* 
* This function generates the security keys as per application requirement.
*
*  Generated Keys are informed through 'CY_BLE_EVT_GAP_KEYS_GEN_COMPLETE'
* This API does not generate identity address (keyInfo->idAddrInfo)
*
*  \param param: buffer is of type cy_stc_ble_gap_sec_key_info_t, where generated keys are store.
*              param->SecKeyParam.bdHandle: parameter ignored
*              param->exchangeKeysFlag : parameters ignored
*              param->localKeysFlag : input parameter
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter for 'keyInfo'
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
*  \note
*  Note1: param should point to a valid memory location until completion of API
*       is indicated via CY_BLE_EVT_GAP_KEYS_GEN_COMPLETE event.
*  Note2: To guarantee that sequential calls to Cy_BLE_GAP_GenerateKeys API generate different keys,
*         a call to Cy_BLE_GenerateRandomNumber should be made between calls made
*        to Cy_BLE_GAP_GenerateKeys API. These calls to Cy_BLE_GenerateRandomNumber API
*        should use unique seeds for these calls.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GenerateKeys
(
    cy_stc_ble_gap_sec_key_info_t  * param
);

