ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
/******************************************************************************
* Function Name: Cy_BLE_GAP_AuthReq
***************************************************************************//**
* 
*  This function starts authentication/pairing procedure with the peer device. 
*  It is a non-blocking function.
*  
*  If the local device is a GAP Central, the pairing request is sent to the GAP
*  Peripheral device. On receiving CY_BLE_EVT_GAP_AUTH_REQ event, the GAP
*  Peripheral is expected to respond by invoking the Cy_BLE_GAPP_AuthReqReply()
*  function.
* 
*  If the local device is GAP Peripheral, a Security Request is sent to GAP
*  Central device. On receiving CY_BLE_EVT_GAP_AUTH_REQ event, the GAP Central
*  device is expected to respond by invoking 'Cy_BLE_GAP_AuthReq ()' function.
*
*  Events shown in the following table may be received by the application based 
*  on the authentication result.
*
*   Event Name                   | Description
*   ------------                 | -----------
*   CY_BLE_EVT_GAP_AUTH_COMPLETE | Pointer to structure of type 'cy_stc_ble_gap_auth_info_t' is returned as parameter to both the peer devices on successful authentication.
*   CY_BLE_EVT_GAP_AUTH_FAILED   | Received by both GAP Central and Peripheral devices (peers) on authentication failure. Data is of type 'cy_en_ble_gap_auth_failed_reason_t'.
*
*  Following events may occur if API result is CY_BLE_SUCCESS:
*
*   Event Name                             | Description
*   ------------                           | -----------
*   CY_BLE_EVT_GAP_SMP_NEGOTIATED_AUTH_INFO| SMP has completed pairing properties (feature exchange) negotiation.
*   CY_BLE_EVT_GAP_KEYINFO_EXCHNGE_CMPLT   | SMP keys exchange with peer device is completed.
*   CY_BLE_EVT_GAP_ENCRYPT_CHANGE          | When there is a change in encryption after pairing procedure.
*
*  Based on IO capabilities, security modes following events may occur
*  during pairing procedure.
*  Please refer to the Core spec 4.2 volume 3 part - H section 2.3.5.1
*  to learn more about Selecting Key Generation Method.
*
*   | Event Name                                |
*   | ------------------------                  |
*   | CY_BLE_EVT_GAP_PASSKEY_DISPLAY_REQUEST    |
*   | CY_BLE_EVT_GAP_KEYPRESS_NOTIFICATION      |
*   | CY_BLE_EVT_GAP_NUMERIC_COMPARISON_REQUEST |
*
*  \param param: Pointer to security information of the device of type 
*             cy_stc_ble_gap_auth_info_t. Param->security can take the value
*             from enum cy_en_ble_gap_sec_level_t.
*  NOTE: If the bonding flag in param is set to CY_BLE_GAP_BONDING_NONE, then 
*        SMP keys will not be distributed even if the application has generated 
*        and set the keys explicitly.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*
*  
*   Error codes                          | Description
*   ------------                         | -----------
*   CY_BLE_SUCCESS                       | On successful operation
*   CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' pointer is NULL or if any of the element of this structure are invalid
*   CY_BLE_ERROR_NO_DEVICE_ENTITY        | Device identified using 'bdHandle' does not exist
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES  | On bonded device is full and application tries to initiate pairing with bonding enable
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_AuthReq
(
    cy_stc_ble_gap_auth_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_AuthPassKeyReply
***************************************************************************//**
* 
*  This function sends a passkey for authentication. It is a non-blocking function.
* 
*  It should be invoked in reply to the authentication request event
*  CY_BLE_EVT_GAP_PASSKEY_ENTRY_REQUEST received by the BLE Stack. This function
*  is used to accept the passkey request and send the passkey or reject the
*  passkey request.
*  
*  * If the authentication operation succeeds, the CY_BLE_EVT_GAP_AUTH_COMPLETE is
*     generated. If the authentication process times out, the CY_BLE_EVT_TIMEOUT 
*     event is generated.
*  * If the authentication fails, the CY_BLE_EVT_GAP_AUTH_FAILED event is generated.
* 
*  \param param: Pointer to security information of the device of type 
*             cy_stc_ble_gap_auth_pk_info_t. 
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Error codes                          | Description
*   ------------                         | -----------
*   CY_BLE_SUCCESS                       | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER       | If param pointer is NULL
*   CY_BLE_ERROR_NO_DEVICE_ENTITY        | Device identified using 'bdHandle' does not exist.
*   CY_BLE_ERROR_INVALID_OPERATION       | If CY_BLE_EVT_GAP_PASSKEY_ENTRY_REQUEST event is not received before this API call
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_AuthPassKeyReply
(   
    cy_stc_ble_gap_auth_pk_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_FixAuthPassKey
***************************************************************************//**
* Sets or clears a fixed passkey to be used by the SMP procedure.
* This is a blocking function. No event is generated on calling this function.
* \note:
*    Note1:  The fixed passkey will work only if we are the device displaying the
*         passkey and peer has to enter the passkey.
*         This will not work for numeric comparison (secure connections) method.
*    Note2:  The fixed passkey is not persistent across power cycle.
*    Note3:  This API should not be called during an ongoing SMP procedure.
*         Call this API on Stack Init completion.
*
*
*  \param param: Parameter is of type 'cy_stc_ble_gap_auth_fix_pk_info_t' 
*
* \return
* cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
* 
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If any of input parameters are invalid.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_FixAuthPassKey
(
    cy_stc_ble_gap_auth_fix_pk_info_t  * param
);


