ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
/******************************************************************************
* Function Name: Cy_BLE_GAP_SetSecureConnectionsOnlyMode
***************************************************************************//**
*
* This API sets the state of the SC Only mode for device.
* If device is in SC Only mode, it will allow pairing to
* complete only with secure connections security. Another kind of pairing will
* lead to pairing failure with reason "Authentication requirement not met"
* You should call this API on host stack on, though it can be called 
* at any point.
* SC Only mode is not persistent across power cycles. It is
* persistent across stack shutdown-init cycles.
*
*  \param param: Parameter is of type 'cy_stc_ble_gap_sc_mode_info_t'
*                bdHandle should be ignored.
*
* \return
* cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Error codes                       | Description
*  ------------                      | -----------
*  CY_BLE_SUCCESS                    | On successful operation.
*  CY_BLE_ERROR_INVALID_OPERATION    | Secure connections feature was not selected in feature config.
*  CY_BLE_ERROR_INVALID_PARAMETER    | If 'param' is NULL or 'state' value is invalid.
*
* Note: This is device level policy and doesn't depend on bdHandle.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_SetSecureConnectionsOnlyMode
(
    cy_stc_ble_gap_sc_mode_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_GenerateSetLocalP256Keys
***************************************************************************//**
*
* This API is used to generate and set  P-256 Public-Private key pair to be using during LE Secure connection 
* pairing procedure. The application may choose to generate a P-256 public-private key pair before pairing 
* process starts. If this API is not called before pairing process starts, the BLE stack will use a default
* public-private key pair.
* Successful completion is informed by CY_BLE_EVT_GAP_GEN_SET_LOCAL_P256_KEYS_COMPLETE event.
* Event parameter contains the keys that are generated and set for LE Secure connection pairing procedure.
*
*
* \return
* cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_OPERATION        | Pairing is in progress or Secure Connections feature is not enabled.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GenerateSetLocalP256Keys
(   
    void
);

/******************************************************************************
* Function Name: Cy_BLE_GAP_SetLocalP256Keys
***************************************************************************//**
*
* This API is used to set a P-256 Public-Private key pair to be used during the LE Secure connection 
* pairing procedure. The application may choose to set a P-256 public-private key pair before the pairing 
* process starts. If this API is not called before the pairing process starts, the BLE stack will use a default
* public-private key pair. This API is not expected to be called when a pairing procedure is in progress.
* The application can provide a P-256 Public-Private key pair to be set for the LE Secure connection pairing procedure.
*
* \param param: Pointer to structure cy_stc_ble_gap_smp_local_p256_keys_t, that has
*                       fields for local P-256 public-private key pair.
*
* \return
* cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                     | Description
*  ------------                     | -----------
*  CY_BLE_SUCCESS                   | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER   | Parameter is NULL Or Public key is not valid
*  CY_BLE_ERROR_INVALID_OPERATION   | Pairing is in progress.
*
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_SetLocalP256Keys
(
    cy_stc_ble_gap_smp_local_p256_keys_t * param
);

/******************************************************************************
* Function Name: Cy_BLE_GAP_AuthSendKeyPress
***************************************************************************//**
*
* This API is used to send the LE Secure connections key press notification to a peer device during secure connection pairing.
* This API should be called by the application to inform the stack about the passkey entry process started for each digit:
* Started (0), entered (1), erased (2), cleared (3). Once all the digits are entered, application needs to call
* 'Cy_BLE_GAP_AuthPassKeyReply()' to inform the stack for passkey enter completed.
* An error will be returned if key press entry bit was not set in 'pairingProperties' of cy_stc_ble_gap_auth_info_t
* during the authentication procedure.
*
*  \param param: Parameter is of type 'cy_stc_ble_gap_sc_kp_notif_info_t'
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                         | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or notificationType is invalid.  
*  CY_BLE_ERROR_INVALID_OPERATION       | If keypress was not negotiated or Secured Connection is not enabled or passkey entry procedure or pairing procedure is not in progress.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_AuthSendKeyPress
(
    cy_stc_ble_gap_sc_kp_notif_info_t  * param
);

