ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
/******************************************************************************
* Function Name: Cy_BLE_GAP_GenerateOobData
***************************************************************************//**
*
* This API is used to generate OOB data based on the input parameter (16 Byte random number)
* This API is called to generate OOB data to be used by peer device. Peer device (or local device with peer's OOB data)
* will use 'Cy_BLE_GAP_SetOobData()' to set the oob data to be used for secure connections pairing.
* API compilation is informed through the 'CY_BLE_EVT_GAP_OOB_GENERATED_NOTIFICATION' event.
* Note: This API must be used only during secured connection pairing.
*
*  \param param: parameter is of type 'cy_stc_ble_gap_sc_oob_info_t'.
*              If 'param->rand' is NULL, stack will generate 16 Bytes random number and then will generate OOB data.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                          | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | If 'param' is NULL.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | Stack resources are unavailable.
*  CY_BLE_ERROR_NO_DEVICE_ENTITY         | Device identified using 'bdHandle' does not exist.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Sufficient memory is not available to handle this request.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GenerateOobData 
(
    cy_stc_ble_gap_sc_oob_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_SetBdAddress
***************************************************************************//**
* 
* This function sets the Bluetooth device address into the BLE stack's memory.
* This address shall be used for all BLE procedures unless explicitly changed by the application.
* The application layer must call this function every time an address change is required. 
* Bluetooth 4.1 Core specification [3.12] specifies that the Bluetooth device can change its
* private address periodically, with the period being decided by the
* application; there are no limits specified on this period. The application
* layer should maintain its own timers in order to do this.
*
* User should call 'Cy_BLE_GAP_SetIdAddress' API to set identity address if 'Cy_BLE_GAP_SetBdAddress'
* API is used to set public or random static address.
* API compilation is informed through the 'CY_BLE_EVT_SET_DEVICE_ADDR_COMPLETE' event
*
*
*  \param param: Bluetooth Device address retrieved from the BLE stack gets stored
*           to a variable pointed to by this pointer. The variable is of type
*           cy_stc_ble_bd_addr_t.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or 
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_SetBdAddress
(
    cy_stc_ble_gap_bd_addr_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_GetBdAddress
***************************************************************************//**
* 
*  This API reads the BD device address from the BLE Controller's memory. This
*  address shall be used for BLE procedures unless explicitly indicated by the BLE
*  Host through HCI commands. 
*  The BD Address is informed through event 'CY_BLE_EVT_GET_DEVICE_ADDR_COMPLETE'
*         
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or 
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GetBdAddress
(
    void
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_SetIdAddress
***************************************************************************//**
*
* This function sets the Bluetooth identity address into BLE Stack. Calling this API will change only
* the identity address of the device. If the public address or static random address is changed by the user, this
* API must be called to set the appropriate address as the identity address.
*
* This is a blocking function. No event is generated on calling this function.
*
* \param param: Pointer to the cy_stc_ble_gap_bd_addr_t structure variable. It has two
*          fields where,
*         * param.addr: Bluetooth Device address buffer that is populated with
*            the device address data.
*         * param.type: Caller function should fill the "address type" to
*            set appropriate address.
*         .
*           Caller function should use param.type = 0x00 to set the "Public
*            Device Address" as identity address. <br>
*           Caller function use param.type = 0x01 to set the "Static Random 
*            Device Address" as identity address.
*
* \return
* cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                     | Description
*  ------------                     | -----------
*  CY_BLE_SUCCESS                   | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER   | On specifying NULL as input parameter.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_SetIdAddress
(
    const cy_stc_ble_gap_bd_addr_t  * param
);


