ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap.h
/******************************************************************************
* Function Name: Cy_BLE_GAP_GetBondList
***************************************************************************//**
*
* This function returns the count and Bluetooth device address along with BD handles of the devices in
* the bonded device list in the order of Rank*. This is a blocking function. No event is generated on
* calling this function.
*
* Rank: The newest device bonded will be at 0 index.
*
*
* Refer Bluetooth 4.1 core specification, Volume 3, Part C, section 9.4.4 for
* details on bonded devices.
*   
* \param param: Buffer to which list of bonded devices will be stored
*                       of type cy_stc_ble_gap_bonded_device_list_info_t.
*
* \return
* cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Errors codes                     | Description
*  ------------                     | -----------
*  CY_BLE_SUCCESS                   | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER   | On specifying NULL as input parameter.
*
*  Note : Provide sufficient memory for 'param->bdHandleAddrList' based on 'bondListSize' 
*  parameter that is passed during Stack Initialization otherwise provided memory might 
*  be corrupted if memory is not sufficient to store all bonded device information.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_GetBondList
(
    cy_stc_ble_gap_bonded_device_list_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_RemoveDeviceFromBondList
***************************************************************************//**
* 
*  This function removes the device from the bond list.
* 
*  Successful operation is informed through 'CY_BLE_EVT_PENDING_FLASH_WRITE' event
* 
*  \param param: Pointer to peer device address, of type cy_stc_ble_gap_bd_addr_t. If the device
*           address is set to 0, then all devices shall be removed from trusted white list.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                     | Description
*   ------------                     | -----------
*   CY_BLE_SUCCESS                   | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER   | On specifying NULL as input parameter for 'bdAddr'.
*   CY_BLE_ERROR_INVALID_OPERATION   | Operation is not permitted when device is in connected state.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_RemoveDeviceFromBondList
(
    cy_stc_ble_gap_bd_addr_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_RemoveOldestDeviceFromBondedList
***************************************************************************//**
* 
*  This function removes the oldest device from the bonded and white lists. 
*  This API should not be called while in the connected state.
*  If the device is connected to the oldest device and this API is called, it will remove the device that is oldest and not
*  connected. 
* 
*  Successful operation is informed through 'CY_BLE_EVT_PENDING_FLASH_WRITE' event
*
* \return
*   cy_en_ble_api_result_t : Return value indicates whether the function succeeded (0x0000) or failed.
*   Following are the possible error codes returned.
*
*   Errors codes                        | Description
*   ------------                        | -----------
*   CY_BLE_SUCCESS                      | On successful operation.
*   CY_BLE_ERROR_MAX                    | On failure operation.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_RemoveOldestDeviceFromBondedList
(
    void
);


/******************************************************************************
* Function Name: Cy_BLE_GAP_SetCeLengthParam
***************************************************************************//**
* 
*  This function sets the connection event length to be used for a specific connection.
*  API completion is informed through the 'CY_BLE_EVT_SET_CE_LENGTH_COMPLETE' event
*
* \return
*   cy_en_ble_api_result_t : Return value indicates whether the function succeeded (0x0000) or failed.
*   Following are the possible error codes returned.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL for input parameter.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY         | Incorrect bdHandle.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
* Note1: The primary usage of this API is to allow application to control bandwidth
*        by setting connection event lengths for specific connections.
* Note2: Application shall set ceLength to 0xFFFF to allow stack to internally
*        use maximum possible bandwidth for this connection.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_SetCeLengthParam
(
    cy_stc_ble_gap_ce_length_param_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_GAP_SetConnectionPriority
***************************************************************************//**
* 
*  This function sets the link layer connection priority to be used for a 
*  connection during arbitration. Link layer arbiter resolves radio contention 
*  based on the priority level of the contending connections. If one or more contending
*  connections have the same priority level (default configuration), then a round-robin 
*  scheme is used to resolve contention. Priority value of 0x00 corresponds to 
*  highest priority and 0xFF is the lowest and default priority setting for a 
*  connection.
*  API completion is informed through the 'CY_BLE_EVT_SET_CONN_PRIORITY_COMPLETE' event
*
* \return
*   cy_en_ble_api_result_t : Return value indicates whether the function succeeded (0x0000) or failed.
*   Following are the possible error codes returned.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL for input parameter.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY         | Incorrect bdHandle.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | If Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | If Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAP_SetConnectionPriority
(
    cy_stc_ble_gap_set_conn_priority_param_t  * param
);

#ifdef __cplusplus
}
#endif /* __cplusplus */

/** @} */

#endif /* CY_BLE_STACK_GAP_H_ */

/*EOF*/
